Repository: LinkNacional/wc_cielo_payment_gateway
Catalog: languages/lkn-wc-gateway-cielo-*.po
Languages: pt_br

source: Payment Gateway for Cielo API on WooCommerce
pt_br: Gateway de Pagamento com API Cielo para WooCommerce

source: Adds the Cielo API 3.0 Payments gateway to your WooCommerce website.
pt_br: Adiciona o método de pagamento Cielo API 3.0 para seu site WooCommerce.

source: Cielo - Credit Card Legacy
pt_br: Cielo - Cartão de Crédito Legado

source: Please contact Cielo for further assistance.
pt_br: Por favor, entre em contato com a Cielo para mais assistência.

source: To use the 3DS functionality it is necessary to register for 3DS 2.2 (request to eCommerce Support).
pt_br: Para utilizar a funcionalidade 3DS é necessário ter o cadastro de 3DS 2.2 (solicitar para o Suporte eCommerce).

source: Allows credit card payment with Cielo API 3.0.
pt_br: Permite pagamentos com cartão de crédito através da Cielo API 3.0

source: Enable/Disable
pt_br: Habilitar/Desabilitar

source: Enable Credit Card Payments
pt_br: Habilita pagamentos via cartão de crédito

source: Title
pt_br: Título

source: This controls the title which the user sees during checkout.
pt_br: Isso controla o título que o usuário vê durante o pagamento.

source: Credit card
pt_br: Cartão de crédito

source: Description
pt_br: Descrição

source: Payment method description that the customer will see on your checkout.
pt_br: Descrição do método de pagamento que o cliente irá ver durante o pagamento.

source: Cielo API 3.0 credentials.
pt_br: Credenciais Cielo API 3.0.

source: Invoice Description
pt_br: Descrição da fatura

source: Invoice description that the customer will see on your checkout (special characters are not accepted).
pt_br: Descrição da fatura que o cliente irá ver durante o pagamento (não é aceito caracteres especiais).

source: Environment
pt_br: Ambiente

source: Cielo API 3.0 environment.
pt_br: Ambiente da Cielo API 3.0.

source: Production
pt_br: Produção

source: Sandbox
pt_br: Teste

source: Capture
pt_br: Captura

source: Enable automatic capture for payments
pt_br: Habilita a captura automática para pagamentos

source: Card Number
pt_br: Número do cartão

source: Expiry Date
pt_br: Data de expiração

source: Card Code
pt_br: Código de segurança

source: Security Code
pt_br: Cód. de Segurança

source: Credit Card number is required!
pt_br: Número de cartão de crédito é obrigatório!

source: Expiration date is required!
pt_br: Data de expiração é obrigatória!

source: CVV is required!
pt_br: CVV é obrigatório!

source: Order payment failed. Please review the gateway settings.
pt_br: Pagamento do pedido falhou. Por favor verifique as configurações do método de pagamento.

source: Order payment failed. Make sure your credit card is valid.
pt_br: Pagamento de pedido falhou. Certifique-se que seu cartão de crédito é válido.

source: Payment completed successfully. Payment id:
pt_br: Pagamento de pedido realizado com sucesso. Id de pagamento:

source: Order refunded, payment id:
pt_br: Pedido reembolsado, id do pagamento:

source: Cielo - Debit and credit card
pt_br: Cielo - Cartão de débito e crédito

source: Allows debit and credit card payment with Cielo API 3.0.
pt_br: Permite pagamentos com cartão de débito e crédito através da Cielo API 3.0.

source: Learn more how to configure.
pt_br: Saiba mais sobre como configurar.

source: Cielo 3DS 2.2 registration required (ask for eCommerce support).
pt_br: Necessário cadastro de Cielo 3DS 2.2 (solicitar para o suporte ecommerce)

source: Enable Debit and Credit Card Payments
pt_br: Habilita pagamentos via cartão de débito e crédito

source: Debit and credit card
pt_br: Cartão de débito e crédito

source: Establishment Code
pt_br: Código de estabelecimento

source: Establishment code for Cielo 3DS E-Commerce 3.0.
pt_br: Código de estabelecimento para Cielo 3DS E-Commerce 3.0.

source: Merchant Name
pt_br: Nome do mercador

source: Establishment name registered on Cielo 3DS E-Commerce 3.0.
pt_br: O nome do estabelecimento registrado no Cielo 3DS E-Commerce 3.0.

source: Establishment Category Code
pt_br: Código de categoria do estabelecimento

source: Establishment category code for Cielo 3DS E-Commerce 3.0.
pt_br: Código de categoria do estabelecimento para Cielo 3DS E-Commerce 3.0.

source: Auth token generation failed.
pt_br: Geração de token de autenticação falhou.

source: Debit Card number is required!
pt_br: Número de cartão de débito é obrigatório!

source: Expiration date is invalid!
pt_br: Data de expiração é inválida!

source: Order payment failed. To make a successful payment using debit card, please review the gateway settings.
pt_br: Pagamento de pedido falhou. Para realizar um pagamento utilizando cartão de débito, por favor revise as configurações do método de pagamento.

source: Order payment failed. Make sure your debit card is valid.
pt_br: Pagamento de pedido falhou. Certifique-se que seu cartão de débito é válido.

source: Settings
pt_br: Configurações

source: Payment processed by Cielo API 3.0
pt_br: Pagamento processado pela Cielo API 3.0

source: order
pt_br: pedido

source: Enable log capture for payments
pt_br: Habilitar captura de log para pagamentos

source: Debug
pt_br: Depuração

source: License
pt_br: Licença

source: License for Cielo API 3.0 plugin extensions.
pt_br: Licença para extensões do plugin Cielo API 3.0.

source: Order refund failed
pt_br: Falha ao reembolsar pedido, id do pagamento:

source: Activation Error:
pt_br: Erro de ativação:

source: You must have
pt_br: Você precisa ter

source: version
pt_br: versão

source: for the Payment Gateway for Cielo API on WooCommerce add-on to activate
pt_br: para o plugin Gateway de Pagamento com API Cielo para WooCommerce ativar

source: plugin installed and activated for the Payment Gateway for Cielo API on WooCommerce add-on to activate
pt_br: plugin instalado e ativo para o plugin Gateway de Pagamento com API Cielo para WooCommerce ativar

source: Credit Card number is invalid!
pt_br: Número de cartão de crédito inválido!

source: Debit Card number is invalid!
pt_br: Número de cartão de débito inválido!

source: CVV is invalid!
pt_br: CVV inválido!

source: Installments
pt_br: Parcelas

source: Installment payments
pt_br: Pagamentos parcelados

source: Enables installment payments for amounts greater than 10,00 R$
pt_br: Habilita pagamentos parcelados para valores maiores que 10,00 R$

source: Credit card is expired!
pt_br: Cartão de crédito está vencido!

source: Debit card is expired!
pt_br: Cartão de débito está vencido!

source: Online card validation
pt_br: Validação de cartão online

source: Enable online bin validation through Cielo API 3.0 (Needs to activate Cielo BIN functionality).
pt_br: Habilita validação online BIN via Cielo API 3.0 (Necessita habilitar funcionalidade BIN da Cielo).

source: This option sets the interest on installment as percentage. Accepts only numbers. Ex.: For 10% interest type 10, blank or zero for no interest tax.
pt_br: Esta opção define os juros da parcela em percentual. Aceita apenas números. Ex.: Para 10% de juros digite 10, deixe em branco ou digite zero para parcela sem taxa de juros.

source: Define a maximum installment quantity. Only certain brands accepts over 12x installments.
pt_br: Define uma quantidade máxima de parcelas. Apenas certas bandeiras aceitam parcelamentos maiores que 12x.

source: Enable payment with interest on installments. Save to continue configuration.
pt_br: Possibilita o pagamento com juros nas parcelas. Salve para continuar a configuração.

source: Installment interest
pt_br: Juros do parcelamento

source: Define installment limit
pt_br: Define um limite de parcelas

source: Interest installment
pt_br: Juros da parcela

source: Installments quantity
pt_br: Quantidade de parcelas

source: Order payment failed. Installment quantity invalid.
pt_br: Pagamento de pedido falhou. Quantidade de parcelas inválida.

source: Invalid Cielo API 3.0 credentials.
pt_br: Credenciais da Cielo API 3.0 inválidas.

source: Invalid Cielo 3DS 2.2 authentication.
pt_br: Autenticação Cielo 3DS 2.2 inválida.

source: Installment
pt_br: Parcelamento

source: Proof of sale (NSU)
pt_br: Comprovante de venda (NSU)

source: Return code
pt_br: Código de retorno

source: Development
pt_br: Desenvolvimento

source: View logs
pt_br: Ver logs

source: Be pro
pt_br: Seja Pro

source: Card Holder Name
pt_br: Nome do Titular do Cartão

source: Card Holder Name is required!
pt_br: O nome do titular do cartão é obrigatório!

source: Card type
pt_br: Tipo de cartão

source: Validate License
pt_br: Validar Licença

source: Click the button to validate your license.
pt_br: Clique no botão para validar sua licença.

source: Invalid or expired license!
pt_br: Licença inválida ou expirada!

source: License validated successfully!
pt_br: Licença validada com sucesso!

source: Interest
pt_br: Juros

source: Payment Complete Status
pt_br: Status de Pagamento Completo

source: Option to automatically set the order status after payment confirmation through this gateway.
pt_br: Opção para definir automaticamente o status do pedido após confirmação de pagamento por esse gateway.

source: Setting to set the order status after payment confirmation according to the product type. None: follow default settings or full payment status.
pt_br: Configuração para definir o status do pedido após a confirmação de pagamento de acordo com o tipo do produto. Nenhum: seguir as configurações padrão ou status de pagamento completo.

source: Please enter a valid CPF or CNPJ.
pt_br: Por favor, insira um CPF ou CNPJ válido.

source: Input placeholders
pt_br: Espaços reservados de entrada

source: Enables input placeholders for debit/credit card fields for classic checkout
pt_br: Permite espaços reservados de entrada para campos de cartão de débito/crédito para checkout clássico

source: Share with
pt_br: Compartilhar com

source: Copied!
pt_br: Copiado!

source: Copy
pt_br: Copiar

source: Share
pt_br: Compartilhar

source: Payment made without 3DS validation
pt_br: Pagamento realizado sem validação 3DS

source: Payment made with 3DS validation
pt_br: Pagamento realizado com validação 3DS

source: General
pt_br: Geral

source: Card
pt_br: Cartão

source: Developer
pt_br: Desenvolvedor

source: Order captured
pt_br: Pedido capturado

source: Order successfully captured!
pt_br: Pedido capturado com sucesso!

source: After the purchase is completed, the PIX will be generated and made available for payment!
pt_br: Após a finalização da compra o PIX será gerado e disponibilizado para o pagamento!

source: Transaction capture is set to manual. Therefore, after the completion of an authorized order, the administrator needs to capture the payment within the order details by clicking the capture button. Otherwise, the payment will be refunded to the buyer's card after 6 days from the order date. If preferred, change it to
pt_br: A captura das transações esta configurada em manual. Portanto após a conclusão do pedido autorizado, o administrador precisa capturar o pagamento dentro dos detalhes do pedido no botão de captura. Caso contrário o pagamento será devolvido para o cartão do comprador após 6 dias da data do pedido. Se preferir altere para

source: Automatic capture.
pt_br: Captura automática.

source: Allows pix payment with Cielo API 3.0.
pt_br: Permite pagamento via pix com a API 3.0 da Cielo.

source: Before using Pix in production, make sure that Pix is enabled in your registration. To confirm, just access the
pt_br: Antes de usar o Pix em produção, certifique-se de que o pix está liberado em seu cadastro. Para confirmar basta acessar o

source: portal Cielo
pt_br: Cielo portal

source: na área logada em Meu Cadastro > Autorizações > PIX
pt_br: in the logged-in area under My Registration > Authorizations > PIX

source: Failed to retrieve card type
pt_br: Falha ao recuperar o tipo de cartão

source: Check with Cielo if the PIX payment method is activated.
pt_br: Verifique na Cielo se o método de pagamento via PIX está ativado.

source: Watch the tutorial
pt_br: Assista ao tutorial

source: or
pt_br: ou

source: check the documentation
pt_br: consulte a documentação

source: for more information.
pt_br: para mais informações.

source: Debit card
pt_br: Cartão de débito

source: Allows Google Pay payment with Cielo API 3.0.
pt_br: Permite pagamentos via Google Pay com Cielo API 3.0.

source: Enable Google Pay Payments
pt_br: Habilitar Pagamentos Google Pay

source: Google Merchant Id
pt_br: ID do Comerciante Google

source: Google Pay production key.
pt_br: Chave de produção do Google Pay.

source: Enter the Merchant ID provided by Google Pay.
pt_br: Insira o ID do Comerciante fornecido pelo Google Pay.

source: Enter the Google Merchant ID for your Google Pay integration.
pt_br: Insira o ID do Comerciante Google para sua integração Google Pay.

source: Google Merchant Name
pt_br: Nome do Comerciante Google

source: Store name in Google Pay.
pt_br: Nome da loja no Google Pay.

source: Enter the Merchant Name provided by Google Pay.
pt_br: Insira o Nome do Comerciante fornecido pelo Google Pay.

source: Enter the Google Merchant Name for your Google Pay integration.
pt_br: Insira o Nome do Comerciante Google para sua integração Google Pay.

source: Google Pay Button Text
pt_br: Texto do Botão Google Pay

source: Pay
pt_br: Pagar

source: Buy
pt_br: Comprar

source: Checkout
pt_br: Finalizar

source: Donate
pt_br: Doar

source: Choose the text to display on the Google Pay button.
pt_br: Escolha o texto a ser exibido no botão Google Pay.

source: Select the text you want to display on the Google Pay button.
pt_br: Selecione o texto que deseja exibir no botão Google Pay.

source: Show Order Logs
pt_br: Visualizar Logs do Pedido

source: Enable transaction log view within the order.
pt_br: Habilitar visualização do log da transação dentro do pedido.

source: Clear Order Logs
pt_br: Limpar Logs dos Pedidos

source: Clear Logs
pt_br: Limpar Logs

source: Do you really want to delete all order logs?
pt_br: Deseja realmente deletar todos os logs dos pedidos?

source: Check this box and save to enable Google Pay settings.
pt_br: Marque esta opção e salve para habilitar as configurações do Google Pay.

source: Enable or disable the Google Pay payment method.
pt_br: Habilitar ou desabilitar o método de pagamento Google Pay.

source: Enable this option to allow customers to pay with Google Pay using Cielo API 3.0.
pt_br: Habilite esta opção para permitir que clientes paguem com Google Pay usando Cielo API 3.0.

source: Enter the title that will be shown to customers during the checkout process.
pt_br: Insira o título que será exibido aos clientes durante o processo de finalização.

source: This text will appear as the payment method title during checkout. Choose something your customers will easily understand, like "Pay with Google Pay (Cielo)".
pt_br: Este texto aparecerá como título do método de pagamento durante o checkout. Escolha algo que seus clientes entendam facilmente, como "Pagar com Google Pay (Cielo)".

source: This description appears below the payment method title at checkout. Use it to inform your customers about the payment processing details.
pt_br: Esta descrição aparece abaixo do título do método de pagamento no checkout. Use para informar seus clientes sobre os detalhes do processamento do pagamento.

source: Provide a brief message that informs the customer how the payment will be processed. For example: "Your payment will be securely processed by Cielo."
pt_br: Forneça uma mensagem breve que informe ao cliente como o pagamento será processado. Por exemplo: "Seu pagamento será processado com segurança pela Cielo."

source: Enter the Merchant ID provided by Cielo for API integration.
pt_br: Insira o ID do Comerciante fornecido pela Cielo para integração da API.

source: This is your Cielo Merchant ID used to authenticate API requests. You can find it in your Cielo dashboard.
pt_br: Este é seu ID de Comerciante Cielo usado para autenticar requisições da API. Você pode encontrá-lo em seu painel Cielo.

source: Enter the Merchant Key provided by Cielo for secure requests.
pt_br: Insira a Chave do Comerciante fornecida pela Cielo para requisições seguras.

source: This is your secret Merchant Key used to sign transactions with Cielo API. Keep it safe and do not share.
pt_br: Esta é sua Chave de Comerciante secreta usada para assinar transações com a API Cielo. Mantenha segura e não compartilhe.

source: Choose between production or development mode for Cielo API.
pt_br: Escolha entre modo produção ou desenvolvimento para a API Cielo.

source: Select "Development" to test transactions in sandbox mode. Use "Production" for real transactions.
pt_br: Selecione "Desenvolvimento" para testar transações em modo sandbox. Use "Produção" para transações reais.

source: Enable this option to log payment requests and responses for troubleshooting purposes.
pt_br: Habilite esta opção para registrar requisições e respostas de pagamento para fins de solução de problemas.

source: Useful for identifying errors in payment requests or responses during development or support.
pt_br: Útil para identificar erros em requisições ou respostas de pagamento durante desenvolvimento ou suporte.

source: When enabled, all Cielo transactions will be logged. You can access logs via WooCommerce > Status > Logs.
pt_br: Quando habilitado, todas as transações Cielo serão registradas. Você pode acessar logs via WooCommerce > Status > Logs.

source: Displays Cielo transaction logs inside WooCommerce order details.
pt_br: Exibe logs de transação Cielo dentro dos detalhes do pedido WooCommerce.

source: Useful for quickly viewing payment log data without accessing the system log files.
pt_br: Útil para visualizar rapidamente dados de log de pagamento sem acessar os arquivos de log do sistema.

source: Enable this to show the transaction details for Cielo payments directly in each order's admin panel.
pt_br: Habilite isto para mostrar os detalhes da transação para pagamentos Cielo diretamente no painel admin de cada pedido.

source: Click this button to delete all Cielo log data stored in orders.
pt_br: Clique neste botão para deletar todos os dados de log Cielo armazenados nos pedidos.

source: Use only if you no longer need the Cielo transaction logs for past orders.
pt_br: Use apenas se não precisar mais dos logs de transação Cielo para pedidos passados.

source: This will permanently remove all stored logs from WooCommerce orders. Ideal after resolving issues or for privacy.
pt_br: Isto removerá permanentemente todos os logs armazenados dos pedidos WooCommerce. Ideal após resolver problemas ou por privacidade.
